Catalogs/ИА_БПМаршрутЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПМаршрутЗадач</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущаяКартаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПКартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВладельцаБПВЗадаче</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеВладельцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ИА_БПТипыТочекМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПТипыТочекМаршрута</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйБизнесПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПСобытияТочекБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПСобытияТочекБП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Условие_ПроверкаУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие_ПриВыполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеНаименования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеСодержания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаОтветственного</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_БПКартыМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПКартыМаршрутов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_БПТочкиМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПТочкиМаршрута</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИА_БПКартыМаршрутов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПТипыТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПТипыАдресацииЗадач</v8:Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПВариантыДней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммнаяОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияДляУсловияИстинно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияДляУсловияЛожно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУведомление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутЗадачВложенногоБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПТипыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращатьАвторуНаПроверку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеЛинии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_БПТочкиМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вариант</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обработчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПСобытияТочекБП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПВариантыОбработчиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыВложенногоБП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПСпособыЗаполненияДопРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ИА_БПРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыводимыеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОчищатьПриСозданииЗадачи</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролироватьЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоПросмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_БПМаршрутЗадач/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрДС(Элементы, Имя, Значение)
    Эл = Элементы.Найти(Имя);
    Если Эл <> Неопределено Тогда
        Эл.Значение = Значение;
        Эл.Использование = Истина;
    КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимостьДоступность()
    Элементы.ГрафСхема.ТолькоПросмотр = НЕ РежимРедактирования;
    
    ////Элементы.кпГрафСхема.Видимость = РежимРедактирования;
    
    Элементы.ФормаГрупповаяУстановкаРеквизитовТочек.Видимость = НЕ РежимРедактирования;
    Элементы.ГруппаПакетнаяОбработка.Видимость = НЕ РежимРедактирования И РежимПакетнойУстановкиРеквизитовТочек;
    
    Элементы.ГруппаРеквизиты.Видимость = НЕ РежимПакетнойУстановкиРеквизитовТочек;
КонецПроцедуры


&НаСервере
Процедура ВывестиСхему()
    Если НЕ РежимРедактирования Тогда
        Карта = Справочники.ИА_БПКартыМаршрутов.ПолучитьКартуМаршрута(Объект.ТекущаяКартаМаршрута);
        ГрафСхема = Карта;
    Иначе
        // Тут заполним "Ответственных"
        Карта = ИА_БФС.КопияОбъекта(ГрафСхема);
        Справочники.ИА_БПКартыМаршрутов.ЗаполнитьВКартеСвязанныеДанные(Карта, Объект.ТекущаяКартаМаршрута);
        ГрафСхема = Карта;
    КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура СоздатьВерсию()
    Справочники.ИА_БПМаршрутЗадач.СоздатьНовуюВерсиюДляМаршрутаЗадач(Объект.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура НачатьРедактирование(СоздаватьНовуюВерсию)
    Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
        ЭтаФорма.Записать();
    КонецЕсли; 
    
    Если НЕ Объект.Ссылка.Пустая()  Тогда
        Если СоздаватьНовуюВерсию Тогда
            СоздатьВерсию();    
            ОповеститьОбИзменении(Объект.Ссылка);
            ЭтаФорма.Прочитать();
            ЭтаФорма.ОбновитьОтображениеДанных();
            ВывестиСхему();
        КонецЕсли; 
        // ИА_Аврамов 15.04.2015  ПоказатьЗначение(,Объект.ТекущаяКартаМаршрута);
        
        Элементы.ФормаРедактировать.Пометка = НЕ Элементы.ФормаРедактировать.Пометка;
        РежимРедактирования = Элементы.ФормаРедактировать.Пометка;
        УстановитьВидимостьДоступность();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьКоличествоБП()
    Колво = 0;
    Если НЕ Объект.Ссылка.Пустая() Тогда
        М = Справочники.ИА_БПКартыМаршрутов.ПолучитьСписокБППоКартеМаршрута(Объект.Ссылка, "Стартован И НЕ Завершен");
        Колво = М.Количество();
    КонецЕсли;
    
    Если Колво = 0 Тогда
        Элементы.НадписьБП.Заголовок = "Выполняемых процессов нет";
    Иначе
        Элементы.НадписьБП.Заголовок = "Выполняемых процессов: " + Колво;
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Пакет_ДобавитьТочку(Точка)
	НовСтрока = ТаблицаТочек.Добавить();
    НовСтрока.Точка = Точка;
    
    Пакет_ПроверитьТаблицуНаСервере();
КонецПроцедуры

&НаСервере
Процедура Пакет_ПроверитьТаблицуНаСервере()
    СписокТипов = ИА_БФКС.Массив_Новый(
    Перечисления.ИА_БПТипыТочекМаршрута.Действие
    ,Перечисления.ИА_БПТипыТочекМаршрута.Условие);
    
	ТЗ = ТаблицаТочек.Выгрузить();
    ИА_БФС.ТЗ_УдалитьДубликаты(ТЗ, "Точка");    
    ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(ТЗ, "НЕ ИА_БФКС.Массив_Содержит(Контекст, СтрокаТЗ.Точка.Тип)", СписокТипов);    
    
    ТаблицаТочек.Загрузить(ТЗ);
КонецПроцедуры
 
 
//_____________________________________________________________

&НаКлиенте
Процедура ОбновлениеГрафСхемыНачать()
    ГрафСхемаКопия = ГрафСхема;
    ГрафСхема = Неопределено;
    ПодключитьОбработчикОжидания("ОбновлениеГрафСхемыЗакончить", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеГрафСхемыЗакончить()
    ГрафСхема = ГрафСхемаКопия;
КонецПроцедуры



//_____________________________________________________________

&НаКлиенте
Процедура ГрафСхемаВыбор(Элемент)
    Если Элемент.ТекущийЭлемент <> Неопределено Тогда
        
        Если РежимПакетнойУстановкиРеквизитовТочек Тогда
            Точка = ПолучитьТочкуНаСервере(Элемент.ТекущийЭлемент.Имя);
            Если ЗначениеЗаполнено(Точка) Тогда
                Пакет_ДобавитьТочку(Точка);
            КонецЕсли;            
        Иначе
            ОткрытьТочку(Элемент.ТекущийЭлемент.Имя);
        КонецЕсли; 
        
        
    КонецЕсли;     
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТочку(ИмяТочки)
    Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
    	ЭтаФорма.Записать();
    КонецЕсли; 
    
    Если НЕ Объект.Ссылка.Пустая() Тогда
        Точка = ПолучитьТочкуНаСервере(ИмяТочки);
        Если ЗначениеЗаполнено(Точка) Тогда
            П = Новый Структура("Ключ, ТолькоПросмотр", Точка, НЕ РежимРедактирования);
            ОткрытьФорму("Справочник.ИА_БПТочкиМаршрута.ФормаОбъекта", П);
        КонецЕсли; 
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТочкуНаСервере(ИмяТочки)
    Точка = Справочники.ИА_БПКартыМаршрутов.ПолучитьТочку(Объект.ТекущаяКартаМаршрута, ИмяТочки);
    Возврат Точка;    
КонецФункции

&НаКлиенте
Процедура ТекущаяКартаМаршрутаПриИзменении(Элемент)
    ВывестиСхему();
    ОбновлениеГрафСхемыНачать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если НЕ ИА_Защита_Общий.ЛицензияДоступна("НФ", Отказ) Тогда Возврат КонецЕсли; 
    
    ЭтоНовый = Объект.Ссылка.Пустая();
    ВывестиСхему();
    
    Если ЭтоНовый Тогда
        Элементы.странцаВерсииМаршрута.Видимость = Ложь;
    Иначе        
        УстановитьПараметрДС(СписокКарт.Параметры.Элементы, "МаршрутЗадач", Объект.Ссылка);	
    КонецЕсли; 
    СформироватьКоличествоБП();
    ТипыВладельцев_Загрузить();
    
    Контекст = Новый Структура("Параметры, Объект, Форма", Параметры, Объект, ЭтаФорма);
    ИА_БПСПереопределяемый.Формы_Точка_Маршрут_ПриСозданииНаСервере(Контекст);
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
    РежимПакетнойУстановкиРеквизитовТочек = Ложь;
    
    Если РежимРедактирования Тогда
        ЭтаФорма.Записать(); // Запишем всё и карту
        РежимРедактирования = Ложь; // Отключим режим
        Элементы.ФормаРедактировать.Пометка = РежимРедактирования;
        
        УстановитьВидимостьДоступность();
        Возврат;
    КонецЕсли; 
    
    
    
    Если НЕ ЗначениеЗаполнено(Объект.ТекущаяКартаМаршрута) Тогда
        НачатьРедактирование(Истина);
    Иначе
        Режим = РежимДиалогаВопрос.ОКОтмена;  
        СЗ = Новый СписокЗначений;
        СЗ.Добавить(КодВозвратаДиалога.Да, "Текущую");
        СЗ.Добавить(КодВозвратаДиалога.Нет, "Создать новую");
        СЗ.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
        Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
        ПоказатьВопрос(Оповещение, "Вы хотите отредактировать текущую карту маршрута или создать новую ?
        |ВНИМАНИЕ! Редактирование текущей карты может привести к неработоспособности уже запущенных по ней процессов", СЗ, 0, КодВозвратаДиалога.Да);
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        НачатьРедактирование(Ложь);
    ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
        НачатьРедактирование(Истина);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
    Если ИмяСобытия = "ОбновитьКарты" И Объект.ТекущаяКартаМаршрута = Параметр Тогда
        ВывестиСхему();
        ОбновлениеГрафСхемыНачать();
        СформироватьКоличествоБП();
    ИначеЕсли ИмяСобытия = "ИА_ТочкаКМИзменена" И Параметр.ВладелецФормы = ЭтаФорма Тогда
        УстановитьРеквизитыТочек(Параметр.ДанныеПакета);
        ТаблицаТочек.Очистить();
        Оповестить("ОбновитьКарты", Объект.ТекущаяКартаМаршрута);
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеДанные(Команда)
    Элементы.ГруппаСлужебные.ТолькоПросмотр = Ложь;     
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    Элементы.странцаВерсииМаршрута.Видимость = Истина;
    УстановитьПараметрДС(СписокКарт.Параметры.Элементы, "МаршрутЗадач", Объект.Ссылка);	
КонецПроцедуры

&НаКлиенте
Процедура НадписьБПНажатие(Элемент)
    Если НЕ Объект.Ссылка.Пустая() Тогда
        Отбор = Новый Структура("ИА_МаршрутЗадачБП, Стартован, Завершен"
        , Объект.Ссылка, Истина, Ложь);
        
        П = Новый Структура("Отбор, ", Отбор);
        ОткрытьФорму("БизнесПроцесс.ИА_БПНоситель.ФормаСписка", П,,ЭтаФорма.УникальныйИдентификатор);
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеВладельцыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
    //Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        ТекущийОбъект = Справочники.ИА_БПМаршрутЗадач.СоздатьЭлемент();
    #КОНЕЦЕСЛИ
    
    Если РежимРедактирования Тогда
        Спр = ТекущийОбъект.ТекущаяКартаМаршрута.ПолучитьОбъект();
        Спр.Карта = Новый ХранилищеЗначения(ГрафСхема);
        Спр.Записать();
    КонецЕсли; 
    
КонецПроцедуры

&НаСервере
Процедура ТипыВладельцев_Загрузить()
    ОТ = ИА_БФС.Типы_ТаблицаСтроковыхТипов2ОписаниеТипов(Объект.ДоступныеВладельцы.Выгрузить());
    ОписаниеТиповВладельцев = ОТ;
КонецПроцедуры

&НаСервере
Процедура ТипыВладельцев_Выгрузить()
    Объект.ДоступныеВладельцы.Очистить();
    Таб = ИА_БФС.Типы_ОписаниеТипов2ТаблицаСтроковыхТипов(ОписаниеТиповВладельцев);
    Объект.ДоступныеВладельцы.Загрузить(Таб);
КонецПроцедуры


&НаКлиенте
Процедура ОписаниеТиповВладельцевПриИзменении(Элемент)
    ТипыВладельцев_Выгрузить();
    Модифицированность = Истина
КонецПроцедуры


&НаКлиенте
Процедура ДопРеквизиты(Команда)
    Если Объект.Ссылка.Пустая() Тогда
        ЭтаФорма.Записать();
    КонецЕсли; 
    
    Если НЕ Объект.Ссылка.Пустая() Тогда
        ОткрытьФорму("ПланВидовХарактеристик.ИА_БПРеквизиты.ФормаСписка"
        , Новый Структура("Отбор", Новый Структура("ВладелецРеквизита", Объект.Ссылка) ));
    КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ГрафСхемаПриИзменении(Элемент)
    Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УстановитьВидимостьДоступность();
КонецПроцедуры


&НаКлиенте
Процедура ГрафСхемаПриАктивизации(Элемент)
    //    ИА_БФКС.СообщениеОбОшибке(""+Элемент.текущийЭлемент); 
КонецПроцедуры

&НаКлиенте
Процедура ГрупповаяУстановкаРеквизитовТочек(Команда)
    РежимПакетнойУстановкиРеквизитовТочек     = НЕ РежимПакетнойУстановкиРеквизитовТочек;
    Если РежимПакетнойУстановкиРеквизитовТочек Тогда
    	Пакет_Ответственный = Истина;
        Пакет_ДлительностьВыполнения = Истина;
    КонецЕсли; 
    
    Элементы.ФормаГрупповаяУстановкаРеквизитовТочек.Пометка = РежимПакетнойУстановкиРеквизитовТочек;
    УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРеквизиты(Команда)
    Пакет_ПроверитьТаблицуНаСервере();
    Если ТаблицаТочек.Количество() = 0 Тогда
    	ИА_БФКС.СообщениеОбОшибке("Нет точек для установки!"); 
        Возврат;
    КонецЕсли; 
    Если НЕ Пакет_Ответственный
        И НЕ Пакет_ДлительностьВыполнения
        Тогда
        ИА_БФКС.СообщениеОбОшибке("Не заданы устанавливаемые реквизиты!"); 
    	Возврат
    КонецЕсли; 
    
    ПерваяТочка = ТаблицаТочек[0].Точка;
    СписокТочек = Новый Массив;
    Для каждого Стр Из ТаблицаТочек Цикл
    	СписокТочек.Добавить(Стр.Точка);
    КонецЦикла; 
    ДанныеПакета = Новый Структура("СписокТочек, Пакет_Ответственный, Пакет_ДлительностьВыполнения"
    , СписокТочек
    , Пакет_Ответственный
    , Пакет_ДлительностьВыполнения);
    
    
    П = Новый Структура("Ключ, РежимПакета, ДанныеПакета", ПерваяТочка, Истина, ДанныеПакета);
    ОткрытьФорму("Справочник.ИА_БПТочкиМаршрута.ФормаОбъекта", П
    , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);    
КонецПроцедуры

&НаСервере
Процедура УстановитьРеквизитыТочек(ДанныеПакета)
	СписокТочек                  = ДанныеПакета.СписокТочек;
    Пакет_Ответственный          = ДанныеПакета.Пакет_Ответственный;
    Пакет_ДлительностьВыполнения = ДанныеПакета.Пакет_ДлительностьВыполнения;
    
    ПерваяТочка = Неопределено;
    
    Для каждого Точка Из  СписокТочек Цикл
    	Если ПерваяТочка = Неопределено Тогда
        	ПерваяТочка = Точка;
        Иначе
            Спр = Точка.ПолучитьОбъект();
            #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
                Спр = Справочники.ИА_БПТочкиМаршрута.СоздатьЭлемент(); ПерваяТочка = Спр.Ссылка;
            #КОНЕЦЕСЛИ
            
            Если Пакет_Ответственный Тогда
                Спр.Ответственный = ПерваяТочка.Ответственный;
                
                Отбор = Новый Структура("Событие", Перечисления.ИА_БПСобытияТочекБП.УстановкаОтветственного);
                ТабСобытие = ИА_БФС.ТЗ_ФильтрПоОтбору(ПерваяТочка.Обработчики.Выгрузить(), Отбор);
                
                Таб = Спр.Обработчики.Выгрузить();
                ИА_БФС.ТЗ_ВставитьТЗПоИзмерениямВДругую(ТабСобытие, Таб, Отбор);
                Спр.Обработчики.Загрузить(Таб);
            КонецЕсли; 
            
            Если Пакет_ДлительностьВыполнения Тогда
                ЗаполнитьЗначенияСвойств(Спр, ПерваяТочка
                , "ВариантДлительности, ДлительностьВыполнения");
            КонецЕсли; 
            
            Спр.Записать();
        КонецЕсли; 
    КонецЦикла; 
    
КонецПроцедуры
